Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/adc/hal_adc_driver.cpp
/*
 * hal_adc_driver.c
 *
 *  Created on: Sep 7, 2011
 *      Author: Sandip

 Would be cooler to use TIM3 trigger instead of CC
 Or use TIM1/TIM2 CC (already in use as main system timers).

 But all kinds of timing problems.
 Lots of cleanup could be done here after Nived's dual mode / continuous mode addition.
 --Nathan



 */

#include <tinyhal.h>
#include <stm32f10x.h>
#include "hal_adc_driver.h"
#include <Samraksh/Hal_util.h>
#include <Timer/advancedtimer/netmf_advancedtimer.h>

uint8_t EMOTE_ADC_CHANNEL[3] = {ADC_Channel_14, ADC_Channel_10, ADC_Channel_0};
ADC_TypeDef* ADC_MODULE[3]   = {ADC1          , ADC2          , ADC3};

void ADC_GPIO_Configuration(BOOL enable);
BOOL ADC_NVIC_Configuration(BOOL enable);
void ADC_RCC_Configuration(BOOL enable);

//TODO: Why do we use g_* when the variables are not extern?
HAL_CALLBACK_FPN g_callback = NULL;
static UINT64 g_timeStamp = 0;

UINT16 *g_adcUserBufferChannel1Ptr = NULL;
UINT16 *g_adcUserBufferChannel2Ptr = NULL;

UINT16 *g_adcDriverBufferChannel1Ptr = NULL;
//UINT16* g_adcDriverBufferChannel2Ptr = NULL; // TODO: Remove. Obsolete.

UINT32 *g_adcDriverBufferDualModePtr = NULL;

UINT32 adcNumSamples = 0;

// TODO: consolidate state machine into one variable.
BOOL batchModeADC = FALSE;
BOOL dmaModeInitialized = FALSE;
BOOL dualADCMode = FALSE;

#ifdef NATIVE_TEST
UINT16 g_adcDriverBufferChannel1[1000];
UINT32 g_adcDriverBufferDualMode[1000];
#endif

extern "C"
{
void ADC_HAL_HANDLER(void *param);
void DMA_HAL_HANDLER(void *param);
void TIM_HAL_HANDLER(void *param);
}

/**
 * interface for Microsoft.SPOT.Hardware.AnalogInput
 */
BOOL AD_Initialize( ANALOG_CHANNEL channel, INT32 precisionInBits )
{

	ADC_InitTypeDef           ADC_InitStructure;
	DMA_InitTypeDef           DMA_InitStructure;
	TIM_TimeBaseInitTypeDef   TIM_TimeBaseStructure;
	TIM_OCInitTypeDef         TIM_OCInitStructure;

	int idx_channel = 0;
	switch (channel) {
	case ANALOG_CHANNEL_1:
	    idx_channel = 0;
	    break;
	case ANALOG_CHANNEL_2:
	    idx_channel = 1;
	    break;
	case ANALOG_CHANNEL_3:
	    idx_channel = 2;
	    break;
	default:
	    ASSERT(0);
	    return false;
	}

	// Turn on the clocks for all the peripherals required
	ADC_RCC_Configuration(TRUE);

	// Enable the appropriate gpio pins
	ADC_GPIO_Configuration(TRUE);

	// Enable interrupts for dma/adc and tim
	// Note that adc and tim enables are for debugging purposes
	// The production code should only have dma
	if(!ADC_NVIC_Configuration(TRUE))
		return FALSE;

	/* ADC1 configuration ------------------------------------------------------*/
	ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
	ADC_InitStructure.ADC_ScanConvMode = ENABLE;
	ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
	ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
	ADC_InitStructure.ADC_NbrOfChannel = 1;

	ADC_Init(ADC_MODULE[idx_channel], &ADC_InitStructure);

	ADC_RegularChannelConfig(ADC_MODULE[idx_channel], EMOTE_ADC_CHANNEL[idx_channel], 1, ADC_SampleTime_41Cycles5);


	  /* Enable ADC1 DMA */
	  //ADC_DMACmd(ADC1, ENABLE);

	/* Enable ADC */
	ADC_Cmd(ADC_MODULE[idx_channel], ENABLE);

	/* Enable ADC reset calibration register */
	ADC_ResetCalibration(ADC_MODULE[idx_channel]);

	/* Check the end of ADC reset calibration register */
	while(ADC_GetResetCalibrationStatus(ADC_MODULE[idx_channel]));  // FIXME: use timeout.

	/* Start ADC calibration */
	ADC_StartCalibration(ADC_MODULE[idx_channel]);

	/* Check the end of ADC calibration */
	while(ADC_GetCalibrationStatus(ADC_MODULE[idx_channel]));   // FIXME: use timeout.

    return TRUE;
}

void AD_Uninitialize( ANALOG_CHANNEL channel )
{
	if(channel == 0)
		ADC_Cmd(ADC1, DISABLE);
	else if(channel == 1)
		ADC_Cmd(ADC2, DISABLE);
	else
		ADC_Cmd(ADC3, DISABLE);
}

INT32 AD_Read( ANALOG_CHANNEL channel )
{

	ADC_SoftwareStartConvCmd(((ADC_TypeDef *) ADC_MODULE[channel]), ENABLE);

	for(UINT32 i=0;i<50;i++);

	return ADC_GetConversionValue((ADC_TypeDef *) ADC_MODULE[channel]);
}

UINT32 AD_ADChannels()
{
    return NUMBER_ADC_CHANNELS;
}

GPIO_PIN AD_GetPinForChannel( ANALOG_CHANNEL channel )
{
    return GPIO_PIN_NONE;
}

BOOL AD_GetAvailablePrecisionsForChannel( ANALOG_CHANNEL channel, INT32* precisions, UINT32& size )
{
    size = 0; return FALSE;
}


/**
 *  Turn on adc/dma and tim4 clocks
 *  @TODO: check for resource sharing before disable.
 */
void ADC_RCC_Configuration(BOOL enable)
{
	/* Enable peripheral clocks ------------------------------------------------*/
	/* Enable DMA1 clock */
	 RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, (FunctionalState)enable);

	 RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, (FunctionalState)enable);

	/* Enable all possibly needed clocks */
	 RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA |
	                        RCC_APB2Periph_GPIOB |
	                        RCC_APB2Periph_GPIOC |
	                        RCC_APB2Periph_ADC1  |
	                        RCC_APB2Periph_ADC2,   (FunctionalState)enable);

}

BOOL ADC_NVIC_Configuration(BOOL enable)
{
	BOOL retInit = TRUE;
	BOOL retCleanup = TRUE;
	if(enable == TRUE) {
		if((retInit &= CPU_INTC_ActivateInterrupt(DMA1_Channel1_IRQn, DMA_HAL_HANDLER, NULL)) != TRUE) {
			goto adc_nvic_cleanup_1;
		}
		if((retInit &= CPU_INTC_ActivateInterrupt(ADC1_2_IRQn,        ADC_HAL_HANDLER, NULL)) != TRUE) {
			goto adc_nvic_cleanup_2;
		}
		if((retInit &= CPU_INTC_ActivateInterrupt(TIM4_IRQn,          TIM_HAL_HANDLER, NULL)) != TRUE) {
			goto adc_nvic_cleanup_3;
		}
	}
	else { /* enable == FALSE */
adc_nvic_cleanup_3:
		retCleanup &= CPU_INTC_DeactivateInterrupt(TIM4_IRQn);
adc_nvic_cleanup_2:
		retCleanup &= CPU_INTC_DeactivateInterrupt(ADC1_2_IRQn);
adc_nvic_cleanup_1:
		retCleanup &= CPU_INTC_DeactivateInterrupt(DMA1_Channel1_IRQn);
	}
	BOOL retFinal = (retCleanup && retInit);
	return retFinal;
}

// TODO: Remove. Obsolete.
//void ADC_RCC_DUALMODE_Configuration(void)
//{
//	  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
//	  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);
//	  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1 | RCC_APB2Periph_ADC2 | RCC_APB2Periph_GPIOC, ENABLE);
//}

// TODO: Remove. Obsolete.
//void ADC_GPIO_DUALMODE_Configuration(void)
//{
//	GPIO_InitTypeDef GPIO_InitStructure;
//
//	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
//	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
//	GPIO_Init(GPIOC, &GPIO_InitStructure);
//
//	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
//	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
//	GPIO_Init(GPIOC, &GPIO_InitStructure);
//
//}

void ADC_GPIO_Configuration(BOOL enable)
{

// Note from Nathan: I don't think you actually have to toggle the pin...
// TODO cleanup, maybe use TIM3 instead (can use ADC_ExternalTrigConv_T3_TRGO) instead of CC

	GPIO_InitTypeDef GPIO_InitStructure;
	if(enable == TRUE)
	{
		// Output of TIM4 CH4 will trigger the adc conversion
		/* Configure TIM4_CH4 (PB9) as alternate function push-pull */
		// GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
		// GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		// GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
		// GPIO_Init(GPIOB, &GPIO_InitStructure); // Disabling to allow for GPIO output

		/* Configure PC.06 as output push-pull */
		// GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
		// GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
		// GPIO_Init(GPIOC, &GPIO_InitStructure); // Disabling to allow for GPIO output

		/* Configure PC.01 and PC.04 (ADC Channel11 and Channel14) as analog input */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_4;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
		//GPIO_Init(GPIOC, &GPIO_InitStructure);
		GPIO_ConfigurePin(GPIOC, GPIO_InitStructure.GPIO_Pin, GPIO_InitStructure.GPIO_Mode);
	}
	else /* enable == FALSE */
	{
		CPU_GPIO_DisablePin(GPIO_GetNumber(GPIOC, GPIO_Pin_0), RESISTOR_DISABLED, GPIO_Mode_IN_FLOATING, GPIO_ALT_PRIMARY);
		CPU_GPIO_DisablePin(GPIO_GetNumber(GPIOC, GPIO_Pin_1), RESISTOR_DISABLED, GPIO_Mode_IN_FLOATING, GPIO_ALT_PRIMARY);
		CPU_GPIO_DisablePin(GPIO_GetNumber(GPIOC, GPIO_Pin_4), RESISTOR_DISABLED, GPIO_Mode_IN_FLOATING, GPIO_ALT_PRIMARY);
	}
}

DeviceStatus AD_ConfigureContinuousMode(UINT16* sampleBuff1, UINT32 numSamples, UINT32 samplingTime, HAL_CALLBACK_FPN userCallback, void* Param)
{
	DeviceStatus retVal = DS_Success;
	UINT32 period;
	UINT32 prescaler = 1;

